# CLI Tools
brew "awscli"
brew "coreutils"
brew "curl"
brew "exiftool"
brew "findutils"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "jq"
brew "lazygit"
brew "node"
brew "openjdk"
brew "poetry"
brew "pyenv"
brew "rsync"
brew "terraform"
brew "tree"
brew "vim"
brew "watch"
brew "wget"

# Fonts
cask "font-meslo-lg-nerd-font"

# Applications
cask "claude-code"
